{"cv_text":"\n\nArtificial  Intelligence  undergraduate  with  experience  in  back-end  and  full-stack  development  using  Node.js,  Express.js,  and\nMongoDB. Skilled in RESTful API design, role-based access control, and database optimization with practical exposure to real-\ntime data processing and scalable architectures. Experienced in delivering projects across complaint management, computer\nvision–based exam monitoring, and airport surveillance systems. Certified in Big Data technologies with strong problem-solving,\nGit/GitHub, and collaborative development skills.\nBaraa Wael\n+201029290728 | baraawael7901@gmail.com | LinkedIn | GitHub | GitLab | Mansoura, Dakahlia, Egypt\n Web Application Developer\nKEY COMPETENCIES \n     PROFESSIONAL EXPERIENCE\nNode.js Development\nExpress.js Framework\nMongoDB Database Design & Integration\nData Modeling & Schema Design \nRESTful API Development\nAuthentication & Authorization (JWT, OAuth)\nDatabase Query Optimization\nBackend Architecture Design\nRole-Based Access Control (RBAC)\nAPI Security & Data Validation\nPython, JavaScript\nGit & GitHub\nSocket.io, Docker, Linux, CI/CD Pipelines\nProblem Solving\nCommunication Skills\n2024 – Present\nFreelance Web Application Developer\nDevelop and deliver custom database-driven web applications tailored to client requirements.\nDesign and implement secure, scalable RESTful APIs to support dynamic front-end features.\nIntegrate interactive dashboards for real-time data visualization and performance tracking.\nOptimize database queries and workflows to ensure efficient, seamless data flow across systems.\nApply responsive design principles to deliver cross-platform, user-friendly web applications.\n     EDUCATION\nBachelor of Artificial Intelligence\nDelta University for Science and Technology \n GPA: 3.3 / 4.0\n2027\n2024Computer Vision Developer – Faculty of AI, Delta University \nEngineered a real-time facial tracking and gaze analysis module to support secure online examination environments.\nDeployed the module into a web-based platform with integrated full-screen lockdown and automated reporting of suspicious\nactivity.\nDesigned and optimized computer vision pipelines with Python and OpenCV to enhance detection precision and reliability.\nCollaborated with a multidisciplinary team, strengthening expertise in version control and collaborative workflows using Git\nand GitHub.\nGained practical experience in AI system deployment and seamless integration within production-level applications.\n2025 – Aug 2025Big Data Trainee – NTI\nCompleted hands-on training in Big Data technologies with a focus on data processing, storage, and analytics.\nGained practical experience with the Hadoop ecosystem, Spark, and distributed computing frameworks.\nApplied Big Data concepts to backend scenarios, enhancing proficiency in scalable, data-driven applications.\nDesigned and executed data workflows for batch and real-time processing to simulate industry use cases.\nStrengthened  problem-solving  and  technical  skills  by  working  on  end-to-end  data  pipelines  and  system  performance\noptimization.\n2024 – PresentBackend Developer – Self-Learning Projects \nDeveloped multiple back-end and full-stack applications leveraging Node.js, Express.js, and MongoDB.\nDesigned and implemented RESTful APIs, integrated databases, and applied Role-Based Access Control (RBAC) across projects.\nUtilized Git and GitHub for version control, collaborative workflows, and project documentation.\n\nOrganize and promote student activities, workshops, and technical events while managing public relations to increase visibility\nand community engagement.\nEnhance communication, collaboration, and teamwork skills through active involvement in volunteer initiatives.\nPROJECTS\nArabic: Native             English: Professional Working Proficiency\nLANGUAGE\nVOLUNTEERING\nPublic Relations Volunteer | IEEE Student Branch2024 – Present\nLed back-end development and integrated a computer vision module to detect real-time cheating behaviors during exam.\nEngineered optimized data pipelines with automated alert notifications for immediate incident reporting.\nEnsured robust back-end and front-end integration to enable seamless live monitoring and user interaction.\nCheating Detection System (Team Project – Grade: A)\nPython, OpenCV, Web Integration\nDesigned  and  implemented a  facial  recognition  surveillance  system  to  identify  criminals  and  fraud  suspects  in  airport\nenvironments.\nDeveloped a live camera streaming dashboard to monitor, track, and log entry/exit activity in real time.\nBuilt an interactive admin dashboard with event logs and real-time suspect tracking, delivering a production-ready full-stack\nsolution with a robust back end, clean UI, and advanced computer vision capabilities.\nAirport Criminal & Fraud Detection System (Solo Project – Grade: A)\nDeveloped a comprehensive system with multiple modules:\nVIP Customers: Managed customer profiles and applied automated loyalty discounts.\nInventory Management: Tracked stock levels, suppliers, and product details.\nSales: Recorded daily sales, applied discounts, and generated detailed reports.\nCashier (POS): Built a user-friendly interface with QR Code scanning for faster checkout.\nImplemented role-based access control for admins, cashiers, and inventory managers.\nIntegrated real-time database updates to ensure stock and sales accuracy.\nSupermarket Management System with QR Code Support (Freelance Project)\nEngineered a full-stack web solution to streamline complaint management in the hospitality industry.\nImplemented Role-Based Access Control (RBAC) to define permissions for customers, employees, and management.\nDesigned an escalation workflow enabling complaint submission, tracking, and resolution.\nIntegrated real-time notifications and dynamic status updates to improve responsiveness.\nStructured MongoDB with detailed history logs to ensure traceability and data integrity.\nYour Solution - Complaint Management System (Full-Stack Web App) (Freelance Project)\nBackend: Node.js with Express.js | Frontend: Next.js | Database: MongoDB LINK\nDesigned and deployed relational database systems to manage hospital, factory, and school operations efficiently.\nBuilt desktop applications with C# (Windows Forms) to provide intuitive user interfaces for staff and administrators.\nOptimized database schemas and validation logic, reducing data entry errors by ~30% and improving overall reliability.\nDatabase Systems for Hospital, Factory, and School (Desktop Applications)\nMySQL, C#, Visual Studio\nCERTIFICATIONS\nNode.js, Express.js, and MongoDB Development\nProblem Solving & Logical Thinking Skills","job_descriptions":["1. Back-End Developer (Node.js & Express) As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","Back-End Developer (Node.js & Express) As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","Back-End Developer (Node.js & Express) As a Back-End Developer, you will be responsible for designing and building scalable RESTful APIs and managing server-side logic and database interactions. You’ll collaborate closely with front-end developers to deliver seamless, secure, and high-performance web applications. Skills: Node.js, Express.js, MongoDB/MySQL, JWT, Git, REST API design, Error handling, Performance optimization. Responsibilities: Develop and maintain APIs and microservices. Integrate third-party APIs (payment, SMS, etc.). Ensure security and data protection. Optimize performance and scalability. Write clean, testable, and maintainable code.","Project Coordinator Support project managers by handling schedules, documentation, and progress tracking. Skills: MS Project, Excel, Time Management. Responsibilities: Track project milestones. Communicate with team members. Prepare status reports."],"top_k":10}